using System;
using System.Collections.Generic;
using System.Text;

namespace mdcore
{
    [Serializable]
    public class UserSchema
    {
        private bool[] table;
        private string name;
        public bool[] SchemaTable { get { return table; } set { table = value; } }
        public string SchemaName { get { return name; } set { name = value; } }

        //-------------- Struct

        static private string[] items = new string[]{
            "Робота касира дозволена",//0
            "Можливість вибору ціни",//1
            "Можливість зміни ціни",//2
            "Задання знижок/надбавок",//3
            "Запитання про необхідність накладної",//4
            "Чеки повернення товарів",//5
            "Збереження чеків без фіксації оплати",//6
            "Об'єднувати однакові товари",//7
            "Застосовувати правила вибору ціни",//8
            "Застосовувати фільтр до поч. к-сті товару",//9
            "Друк фіксованих чеків на дод. принтетрі",//10
            "Друк нефіксованих чеків на дод. принтетрі",//11
            "Показувати суму нефіксованих чеків",//12
            "Використання карток покупця (999...)",//13
            "Сортувати вибрані товари по коду",//14
            "Використання карток клієнат (998...)",//15
            "Використання додаткових штрих-кодів",//16
            "Запит початкової к-сті",//17
            "Оплата готівкою",//18
            "Оплата в кредит",//19
            "Оплата чеком",//20
            "Оплата платіжною карткою",//21
            "Активна кількість",//22
            "Можливість закриття чеку",//23
            "Можливість зміни чеку"//24
        };

        public string[] SchemaItems { get { return items; } }
        static public byte ItemsCount { get { return (byte)items.Length; } }
    }
}
